#include<stdio.h>

int main() {

  char hrgn[81][4] = {
            "あ","い","う","え","お","か","き","く","け","こ",
	    "さ","し","す","せ","そ","た","ち","つ","て","と",
	    "な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ",
	    "ま","み","む","め","も","や","ゆ","よ",
	    "ら","り","る","れ","ろ","わ","を","ん",           // ここまでで46
	    "が","ぎ","ぐ","げ","ご","ざ","じ","ず","ぜ","ぞ",
	    "だ","ぢ","づ","で","ど","ば","び","ぶ","べ","ぼ",
	    "ぱ","ぴ","ぷ","ぺ","ぽ","ぁ","ぃ","ぅ","ぇ","ぉ",
	    "ゃ","ゅ","ょ","ゎ","っ"};
  unsigned i, j, k, l, m, n, o, p, q, r; // rまでで10個
  unsigned count = 0;
  unsigned brank = 0;

  for (i = 0; i < 1; i++)            // ループ回数は段の数。「わ」行なら i < 3
    for (j = 0; j < 1; j++)
      for (k = 0; k < 3; k++)
	for (l = 0; l < 3; l++)
	  for (m = 0; m < 2; m++)
	    for (n = 0; n < 3; n++)
	      for (o = 0; o < 2; o++)
		for (p = 0; p < 1; p++)
		  for (q = 0; q < 4; q++)
		    for (r = 0; r < 3; r++) {
		      printf("%s", hrgn[0+i]);  // hrgn[(数字)+i] 下記参照
		      printf("%s", hrgn[80+j]);
		      printf("%s", hrgn[66+k]);
		      printf("%s", hrgn[38+l]);
		      printf("%s", hrgn[10+m]);
		      printf("%s", hrgn[43+n]);
		      printf("%s", hrgn[51+o]);
		      printf("%s", hrgn[76+p]);
		      printf("%s", hrgn[56+q]);
		      printf("%s", hrgn[10+r]);
		      printf("　");
		      count++;
		      brank++;
		      if (brank == 4) { // 適切な改行(4文字なら9が最適)
			putchar('\n');
			brank = 0;
		      }
		    }


  printf("\n組み合わせ: %d通り\n", count);
  return 0;
}

/*
「あ」行をループしたい場合: hrgn[0+i]
「か」行をループしたい場合: hrgn[5+i]
「さ」行をループしたい場合: hrgn[10+i]
「た」行をループしたい場合: hrgn[15+i]
「な」行をループしたい場合: hrgn[20+i]
「は」行をループしたい場合: hrgn[25+i]
「ま」行をループしたい場合: hrgn[30+i]
「や」行をループしたい場合: hrgn[35+i] ループ回数は３回 for (i = 0; i < 3;...)
「ら」行をループしたい場合: hrgn[38+i]
「わ」行をループしたい場合: hrgn[43+i] ループ回数は３回 for (i = 0; i < 3;...)
「が」行をループしたい場合: hrgn[46+i]
「ざ」行をループしたい場合: hrgn[51+i]
「だ」行をループしたい場合: hrgn[56+i]
「ば」行をループしたい場合: hrgn[61+i]
「ぱ」行をループしたい場合: hrgn[66+i]
「ぁ」行をループしたい場合: hrgn[71+i]
「ゃ」行をループしたい場合: hrgn[76+i] ループ回数は３回 for (i = 0; i < 3;...)

「ゎ」を表示したい場合: hrgn[79]
「っ」を表示したい場合: hrgn[80]
 */
